Reports/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереключательРежим</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ТоварыВРезервеНаСкладах/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Истина;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	//УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	// При написании текста запроса рекомендуется следовать правилам, описанным в следующем шаблоне текста запроса:
	//
	//ВЫБРАТЬ
	//	<ПсевдонимТаблицы.Поле> КАК <ПсевдонимПоля>,
	//	ПРЕДСТАВЛЕНИЕ(<ПсевдонимТаблицы>.<Поле>),
	//	<ПсевдонимТаблицы.Показатель> КАК <ПсевдонимПоказателя>
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//{ВЫБРАТЬ
	//	<ПсевдонимПоля>.*,
	//	<ПсевдонимПоказателя>,
	//	Регистратор,
	//	Период,
	//	ПериодДень,
	//	ПериодНеделя,
	//	ПериодДекада,
	//	ПериодМесяц,
	//	ПериодКвартал,
	//	ПериодПолугодие,
	//	ПериодГод
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//}
	//ИЗ
	//	<Таблица> КАК <ПсевдонимТаблицы>
	//	//СОЕДИНЕНИЯ
	//{ГДЕ
	//	<ПсевдонимТаблицы.Поле>.* КАК <ПсевдонимПоля>,
	//	<ПсевдонимТаблицы.Показатель> КАК <ПсевдонимПоказателя>,
	//	<ПсевдонимТаблицы>.Регистратор КАК Регистратор,
	//	<ПсевдонимТаблицы>.Период КАК Период,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ДЕНЬ) КАК ПериодДень,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ДЕКАДА) КАК ПериодДекада,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, МЕСЯЦ) КАК ПериодМесяц,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, КВАРТАЛ) КАК ПериодКвартал,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ГОД) КАК ПериодГод
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//}
	//{УПОРЯДОЧИТЬ ПО
	//	<ПсевдонимПоля>.*,
	//	<ПсевдонимПоказателя>,
	//	Регистратор,
	//	Период,
	//	ПериодДень,
	//	ПериодНеделя,
	//	ПериодДекада,
	//	ПериодМесяц,
	//	ПериодКвартал,
	//	ПериодПолугодие,
	//	ПериодГод
	//	//УПОРЯДОЧИТЬ_СВОЙСТВА
	//	//УПОРЯДОЧИТЬ_КАТЕГОРИИ
	//}
	//ИТОГИ
	//	АГРЕГАТНАЯ_ФУНКЦИЯ(<ПсевдонимПоказателя>)
	//	//ИТОГИ_СВОЙСТВА
	//	//ИТОГИ_КАТЕГОРИИ
	//ПО
	//	ОБЩИЕ
	//{ИТОГИ ПО
	//	<ПсевдонимПоля>.*,
	//	Регистратор,
	//	Период,
	//	ПериодДень,
	//	ПериодНеделя,
	//	ПериодДекада,
	//	ПериодМесяц,
	//	ПериодКвартал,
	//	ПериодПолугодие,
	//	ПериодГод
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//}
	//АВТОУПОРЯДОЧИВАНИЕ
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегЗаказы.Склад КАК Склад,
	               |	ПРЕДСТАВЛЕНИЕ(РегЗаказы.Склад) КАК СкладПредставление,
	               |	РегЗаказы.ДокументРезерва КАК ДокументРезерва,
	               |	ПРЕДСТАВЛЕНИЕ(РегЗаказы.ДокументРезерва) КАК ДокументРезерваПредставление,
	               |	РегЗаказы.Номенклатура КАК Номенклатура,
	               |	ПРЕДСТАВЛЕНИЕ(РегЗаказы.Номенклатура) КАК НоменклатураПредставление,
	               |	РегЗаказы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПРЕДСТАВЛЕНИЕ(РегЗаказы.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
	               |	РегЗаказы.СерияНоменклатуры КАК СерияНоменклатуры,
	               |	ПРЕДСТАВЛЕНИЕ(РегЗаказы.СерияНоменклатуры) КАК СерияНоменклатурыПредставление,
	               |	РегЗаказы.КоличествоОстаток КАК КоличествоОстаток,
	               |	ВЫБОР
	               |		КОГДА (РегЗаказы.Склад.Код = ""000000026""
	               |				ИЛИ РегЗаказы.Склад.Код = ""000000023"")
	               |				И (ПолучитьЗаказ.СрокИзготовления = НЕОПРЕДЕЛЕНО
	               |					ИЛИ ПолучитьЗаказ.СрокИзготовления = ДАТАВРЕМЯ(1, 1, 1)
	               |					ИЛИ ПолучитьЗаказ.СрокИзготовления < &Дата)
	               |			ТОГДА ПолучитьОтчет.ДатаПошиваНачало
	               |		ИНАЧЕ ПолучитьЗаказ.СрокИзготовления
	               |	КОНЕЦ КАК СрокИзготовления,
	               |	ПолучитьОтчет.ДатаПошиваНачало КАК ДатаПошиваНачало,
	               |	ПолучитьОтчет.ДатаПошиваКонец КАК ДатаПошиваКонец,
	               |	ПолучитьОтчет.Ссылка КАК ОтчетЗаСмену
	               |{ВЫБРАТЬ
	               |	Склад.*,
	               |	ДокументРезерва.*,
	               |	Номенклатура.*,
	               |	ХарактеристикаНоменклатуры.*,
	               |	СерияНоменклатуры.*,
	               |	КоличествоОстаток,
	               |	СрокИзготовления}
	               |ИЗ
	               |	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаКон, ) КАК РегЗаказы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаказПокупателяТовары.СрокИзготовления КАК СрокИзготовления,
	               |			ЗаказПокупателяТовары.Ссылка КАК Ссылка,
	               |			ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	               |			ЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |		ИЗ
	               |			Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары) КАК ПолучитьЗаказ
	               |		ПО РегЗаказы.ДокументРезерва.Номер = ПолучитьЗаказ.Ссылка.Номер
	               |			И (ВЫБОР
	               |				КОГДА РегЗаказы.НК <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |					ТОГДА РегЗаказы.НК = ПолучитьЗаказ.ХарактеристикаНоменклатуры
	               |				ИНАЧЕ РегЗаказы.ХарактеристикаНоменклатуры = ПолучитьЗаказ.ХарактеристикаНоменклатуры
	               |			КОНЕЦ)
	               |			И (РегЗаказы.Склад.Код = ""000000026""
	               |				ИЛИ РегЗаказы.Склад.Код = ""000000023"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МАКСИМУМ(ОтчетПроизводстваЗаСменуПродукция.ДатаПошиваНачало) КАК ДатаПошиваНачало,
	               |			МАКСИМУМ(ОтчетПроизводстваЗаСменуПродукция.ДатаПошиваКонец) КАК ДатаПошиваКонец,
	               |			МАКСИМУМ(ОтчетПроизводстваЗаСменуПродукция.Ссылка) КАК Ссылка,
	               |			ОтчетПроизводстваЗаСменуПродукция.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |		ИЗ
	               |			Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ОтчетПроизводстваЗаСменуПродукция.ХарактеристикаНоменклатуры) КАК ПолучитьОтчет
	               |		ПО РегЗаказы.ХарактеристикаНоменклатуры = ПолучитьОтчет.ХарактеристикаНоменклатуры
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &режим = 1
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ РегЗаказы.Склад.Код = ""000000023""
	               |					ИЛИ РегЗаказы.Склад.Код = ""000000026""
	               |		КОНЕЦ
	               |{ГДЕ
	               |	РегЗаказы.Склад.*,
	               |	РегЗаказы.ДокументРезерва.*,
	               |	РегЗаказы.Номенклатура.*,
	               |	РегЗаказы.ХарактеристикаНоменклатуры.*,
	               |	РегЗаказы.СерияНоменклатуры.*,
	               |	РегЗаказы.КоличествоОстаток}
	               |{УПОРЯДОЧИТЬ ПО
	               |	Склад.*,
	               |	ДокументРезерва.*,
	               |	Номенклатура.*,
	               |	ХарактеристикаНоменклатуры.*,
	               |	СерияНоменклатуры.*,
	               |	КоличествоОстаток,
	               |	ДатаПошиваКонец,
	               |	ДатаПошиваНачало,
	               |	СрокИзготовления}
	               |ИТОГИ
	               |	СУММА(КоличествоОстаток),
	               |	МАКСИМУМ(СрокИзготовления),
	               |	МАКСИМУМ(ДатаПошиваНачало),
	               |	МАКСИМУМ(ДатаПошиваКонец),
	               |	МАКСИМУМ(ОтчетЗаСмену)
	               |ПО
	               |	ОБЩИЕ
	               |{ИТОГИ ПО
	               |	Склад.*,
	               |	ДокументРезерва.*,
	               |	Номенклатура.*,
	               |	ХарактеристикаНоменклатуры.*,
	               |	СрокИзготовления,
	               |	ДатаПошиваКонец,
	               |	ДатаПошиваНачало,
	               |	ОтчетЗаСмену,
	               |	СерияНоменклатуры.*}
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля( "РегЗаказы.Номенклатура" ,               "Номенклатура",               "Номенклатура",                ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля( "РегЗаказы.ХарактеристикаНоменклатуры" , "ХарактеристикаНоменклатуры", "Характеристика номенклатуры", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Дата", ТекущаяДата());


	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоОстаток",          "Количество");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоОстаток",          "Количество");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДокументРезерва",            "Документ резерва");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ХарактеристикаНоменклатуры", "Характеристика номенклатуры");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ЕдиницаИзмерения",           "Единица измерения");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СерияНоменклатуры",          "Серия номенклатуры");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СрокИзготовления",           "Срок Заказа");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаПошиваНачало",           "Дата Начала Производства");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаПошиваКонец",            "Дата Конец Производства");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОтчетЗаСмену",               "ОтчетЗаСмену");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоОстаток", "Количество",        Истина, "ЧЦ=15; ЧДЦ=3"); 
	УниверсальныйОтчет.ДобавитьПоказатель("СрокИзготовления",  "СрокИзготовления",  Истина, "ДФ='dd.MM.yyyy'");  
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоОстаток", "Количество",        Истина, "ЧЦ=15; ЧДЦ=3");
	УниверсальныйОтчет.ДобавитьПоказатель("ДатаПошиваНачало",  "ДатаПошиваНачало",  Ложь, "ДФ='dd.MM.yyyy'");
	УниверсальныйОтчет.ДобавитьПоказатель("ДатаПошиваКонец",   "ДатаПошиваКонец",   Ложь, "ДФ='dd.MM.yyyy'");
	УниверсальныйОтчет.ДобавитьПоказатель("ОтчетЗаСмену",       "ОтчетЗаСмену",     Ложь, "ЧЦ=15; ЧДЦ=3"); 

	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Склад");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ДокументРезерва");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СрокИзготовления");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ДатаПошиваНачало");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ДатаПошиваКонец");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ОтчетЗаСмену");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Склад");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	УниверсальныйОтчет.ДобавитьОтбор("ДокументРезерва"); 
	УниверсальныйОтчет.ДобавитьОтбор("СрокИзготовления");
	УниверсальныйОтчет.ДобавитьОтбор("ДатаПошиваНачало");
	УниверсальныйОтчет.ДобавитьОтбор("ДатаПошиваКонец");
	УниверсальныйОтчет.ДобавитьОтбор("ОтчетЗаСмену");
	
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка представлений полей
	// УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Режим", ПереключательРежим);
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
